{"data":{"site":{"siteMetadata":{"title":"warizz.io","author":"Warizz Yutanan"}},"markdownRemark":{"id":"76997773-499a-5a44-8bca-f7b25d229844","excerpt":"I’m turning 35 next year, it passed half life already so I should step forward carefully. Pick what’s really matters and prioritize them, be more focus. Work…","html":"<p>I’m turning 35 next year, it passed half life already so I should step forward carefully. Pick what’s really matters and prioritize them, be more focus.</p>\n<h2>Work</h2>\n<ul>\n<li>Should be improved based on my metrics</li>\n<li>Learn <code class=\"language-text\">Go</code> — personal interested, Its philosophy feels minimalistic to me.</li>\n<li>Learn <code class=\"language-text\">Kubernetes</code> — this can improve my workflow when we have so many projects working together these days.</li>\n<li>Learn <code class=\"language-text\">data science</code>— I think programming world going toward this way, building data-based machine to help us work better.</li>\n</ul>\n<h2>Life</h2>\n<ul>\n<li><strong>Emotionless</strong>, to be specific, no angry. This can be tracked by note down every time I get angry. Goal is to make them as less as possible. It will be good to any person around me especially my girl friend that I spend most of the time with. (love you xo xo).</li>\n<li><strong>Climb better</strong>— 20 v4s, 20 6a, 5 v5s. Every time I sent a target route I took a picture then saved it to Google Photos album named by level. Ultimate goal (2–3 years plan) is to climb <a href=\"https://youtu.be/7DCiOy6Dxe8\">somewhere magnificent</a>.</li>\n<li><strong>At least a marathon</strong> — I finished it once (5.5 hours) long time ago. Actually this was set by my girl friend, it is good to have any common goal together and climbing needs both strength and endurance so working this long running activity should help improve it.</li>\n<li><strong>Lose weight</strong> — ideal is to be as lean as possible. The target is 65kg (currently 75). Yeah this leads to improvement of my climbing.</li>\n<li><strong>More writing, more drawing</strong> — 100 articles, 3 days per 1 post seems not hard at all. How about drawing? I’m planing to have some visual essays about my (wannabe) minimalistic life.</li>\n<li><strong>Learn music</strong>-I used to practice guitar but it never go anywhere. I’m taking it seriously this time by taking a course to learn its fundamental. The target instrument may be guitar, drum or piano.</li>\n</ul>","frontmatter":{"title":"Goals: 2019","date":null}}},"pageContext":{"slug":"/goals-2019/","previous":null,"next":{"fields":{"slug":"/on-commute/"},"frontmatter":{"title":"On commute"}}}}