{"data":{"site":{"siteMetadata":{"title":"warizz.io","author":"Warizz Yutanan"}},"markdownRemark":{"id":"1de0d78a-4ae6-5779-bf28-fd57f4d4b305","excerpt":"…","html":"<p>ถึงคอนโดจะเป็นคำตอบที่ดีที่สุดในตอนนี้ เพราะทำงานในเมืองสะดวกเดินทาง แต่ความไฝ่ฝันจะมีบ้านเป็นของตัวเอง และดีไซน์แบบที่ชอบ ก็ยังมีอยู่ และก็ไม่ได้คิดจะอยู่ในเมืองไปตลอดชีวิตอยู่แล้ว แพลนที่คิดไว้เล่นๆก็คือ พอผ่อนคอนโดปัจจุบันหมด ,  น่าจะสัก ๑๐ ถึง ๑๕ ปี ,  ก็จะเริ่มไปหาที่สร้างบ้าน นอกเมือง</p>\n<p>๑๕ ปีนี้มันนานมากนะ เป็นระยะเวลาที่ถ้าเราเริ่มต้นเรียนรู้อะไรสักอย่าง แล้วทำมันไปเรื่อยๆ ตลอด อย่างสม่ำเสมอ เราสามารถกลายเป็นผู้เชี่ยวชาญได้เลย  </p>\n<p>เรียนรู้เรื่องสถาปัตยกรรม ก็น่าสนใจ ถ้าอยากได้บ้านที่มีดีไซน์เป็นของตัวเอง ก็ต้องสร้างขึ้นจากศูนย์ ไม่ถึงกับต้องสร้างเองทุกอย่างหรอก แต่แค่มีความรู้ที่จะไปตรวจงานผู้รับเหมาได้ ก็คุ้มค่าแล้ว นี่ถ้าบังเอิญไปได้ดี สามารถออกแบบภายใน ภายนอกได้เอง ก็จะยิ่งมีประโยชน์, ๑๐ ปี สามารถเรียนจบมหาวิทยาลัย และมีประสบการณ์ทำงานอีก ๖ ปีเลยนะ</p>\n<hr>\n<p>Even though having a condominium is the best answer right now because of work place and short commute time but the dream of owning a house that has the design I like is still exist. I never think of living in a crowded city the whole life anyway. Roughly plan is after I paid all the mortgage — estimation is 10 to 15 years — I will have a house outside of town.</p>\n<p>15 year is very loooong time. If we learn something and do it regularly throughout the period, we can be a professional.</p>\n<p>Architecture is interesting, if you want a house that fit your desire, you have to build it yourself instead of buying a completed one. You don’t have to do it yourself entirely, just to be able to deal with house contractors is a worth to try, able to design interior or exterior is a plus. You can finish a college and then have 6 years professional experience in this period.\nI’m on a practice of writing in English, if you reader found any grammatical errors please help point it out will be very appreciated.</p>\n<hr>","frontmatter":{"title":"Random thought: on building a house","date":null}}},"pageContext":{"slug":"/random-thought-on-building-a-house/","previous":{"fields":{"slug":"/hi-folks/"},"frontmatter":{"title":"New Beginnings"}},"next":null}}