{"data":{"site":{"siteMetadata":{"title":"warizz.io","author":"Warizz Yutanan"}},"markdownRemark":{"id":"ecd498c3-0d23-5656-9c74-a9dde96e7f84","excerpt":"In  Mission To The Moon, 236th episode  somebody asked about ‘direct feedback’ which is very interesting because it can be use for both work and life. There are…","html":"<p>In <a href=\"https://soundcloud.com/missiontothemoon/ep-236-9-2561\">Mission To The Moon, 236th episode</a> somebody asked about ‘direct feedback’ which is very interesting because it can be use for both work and life. There are 4 types of it.</p>\n<ul>\n<li>Negative and destructive</li>\n<li>Negative and constructive</li>\n<li>Positive and destructive</li>\n<li>Positive and constructive</li>\n</ul>\n<p>Destructive is a feedback that only mean to make listeners feel bad, for example “You write bad code, stop doing it”, this doesn’t give any clues why it is bad or how to improve it. So constructive way is to give “what”, “why” and “how”.</p>\n<p>As we know that there are no benefits of negative destructive feedback (may be a little satisfaction to the giver) and receivers will also feel defeated or even get angry, so we should avoid it if possible. Even though we sometimes have to give a negative feedback even in a constructive way, we should carefully think about how to make the negative part softer.</p>\n<p>In life outside of work is a lot harder, especially family members or close friends, so many people (included me) keep their mouth shut to avoid the fight. So positive + constructive is a good way to do it.</p>\n<p>Let’s try to solve this situation just to practice, if you found out that your partner didn’t clean dishes properly (some still have stain), how will you give a positive constructive feedback? I can start with the positive “Hey, how nice of you clean all the dishes” then “but I think we have to change current dishwashing soap because it still leaves some mark on them” (ummm I don’t think this is constructive, it just detour destructive) or try “Next time we finished our food, I think I will help you roughly wash dishes first so it will be easier when you come to finish them later, not leaving hard stain like this time” (constructive by using yourself as bait)</p>\n<p>I think giving good feedback can be practiced, the key is to keep in mind that we have to do it.</p>\n<hr>\n<p>วันนี้ได้ฟัง <a href=\"https://soundcloud.com/missiontothemoon/ep-236-9-2561\">Mission To The Moon episode ที่ 236</a> มีคนถามเรื่อง direct feedback น่าสนใจดี เพราะมันจะนำไปใช้ได้ทั้งเรื่องงานและชีวิตประจำวัน สรุปได้คร่าวๆว่า มันมีอยู่ 4 แบบ</p>\n<ul>\n<li>Negative and destructive</li>\n<li>Negative and constructive</li>\n<li>Positive and destructive</li>\n<li>Positive and constructive</li>\n</ul>\n<p>negative และ positive ก็คือการติและชม destructive ก็คือการตำหนิที่ไม่ได้เสนอแนะแนวทาง หรือช่วยเหลือผู้ฟังให้พัฒนาตัวเองขึ้นมาได้ เช่น ทีมลีดตำหนิลูกทีมว่า เขียนโค้ดแย่มาก โดยไม่ให้เหตุผล หรือวิธีการเขียนที่ดีกว่า ส่วน constructive ก็คือการ บอกลูกทีมว่า เขียนแบบนี้สิ มันดีกว่า เพราะอ่านง่าย และมี performance ที่ดีกว่า พร้อมให้ตัวอย่าง</p>\n<p>อย่างที่รู้กันว่า negative และ destructive นั้นนอกจากจะไม่ก่อให้เกิดประโยชน์กับใครแล้ว (อาจจะสะใจแก่ผู้พูด) ยังก่อผลลบแก่ผู้ฟังอีก เพราะฉะนั้นถ้าเป็นไปได้ก็ควรหลีกเลี่ยง และคิดเยอะๆ ก่อนพูดทุกครั้ง negative + constructive คิดว่า บางครั้งก็เลี่ยงไม่ได้ ถ้าจำเป็นต้องตำหนิจริงๆ ก็ต้องหาวิธีพูดให้นิ่มนวลที่สุด</p>\n<p>การให้ feedback ในชีวิตประจำวันนั้นยากกว่าในที่ทำงานมาก เพราะถ้าเป็นคนในครอบครัว หรือแม้แต่เพื่อน เรายิ่งต้องระวังเรื่องการไปกระทบจิตใจคนฟัง คนจำนวนมาก(รวมถึงตัวผมเองด้วย) เลือกที่จะไม่เตือนหรือตำหนิในบางเรื่อง เพื่อหลีกเลี่ยงการพิพาท การให้ feedback ที่เป็น positive และ constructive จึงเป็นการแก้ปัญหาที่ดี</p>\n<p>ลองคิดเล่นๆว่า ถ้าเราเจอคราบอาหารบนจานชามที่แฟนล้างไว้ การให้ positive + constructive feedback ก็ควรจะเป็นอย่างไรได้บ้าง เท่าที่ผมพอจะนึกได้คือ เธอน่ารักมาก อุตส่าห์ล้างจานให้ (เริ่มด้วย positive) แต่สงสัยน้ำยาล้างจานจะไม่ค่อยดี เพราะมันยังเหลือคราบอยู่หน่อยนึงตรงนี้ (ไม่ค่อย constructive สักเท่าไหร่ เหมือนเป็น destructive แบบอ้อมๆ มากกว่า) หรือ คราวหน้าหลังกินเสร็จเดี๋ยวเราเอาฟองน้ำล้างคร่าวๆให้ก่อนรอบนึง เวลาแฟนมาล้างทีหลังจะได้ล้างง่ายๆ ไม่เหลือคราบ (เป็นการ constructive อ้อมๆ โดยเอาตัวเองเข้าแลก)</p>\n<p>การให้ความเห็นที่ดีนั้นต้องใช้ทั้งศาสตร์และศิลป์พอสมควร แต่ผมว่าเรื่องพวกนี้นั้นฝึกได้ ขอแค่ต้องพึงระลึกไว้เสมอ</p>","frontmatter":{"title":"Positive Constructive Feedback","date":"December 22, 2018"}}},"pageContext":{"slug":"/positive-constructive-feedback/","previous":{"fields":{"slug":"/random-thought-on-building-a-house/"},"frontmatter":{"title":"Random thought: on building a house"}},"next":null}}