{"data":{"site":{"siteMetadata":{"title":"warizz.io","author":"Warizz Yutanan"}},"markdownRemark":{"id":"b02cfc77-2ef3-5a58-a077-26ff36820c36","excerpt":"tl;dr. Objective is a fact, Subjective is an opinion and Intersubjective is an opinion that more than one person are agree upon. While listening to  Sapiens : a…","html":"<p>tl;dr. Objective is a fact, Subjective is an opinion and Intersubjective is an opinion that more than one person are agree upon.</p>\n<p>While listening to <a href=\"https://www.audible.com/pd/Sapiens-Audiobook/B0741G911Q\">Sapiens : a brief history of humankind</a>; There is no justice in history, I heard of the word “Intersubjective” which is new to me. So I do some research.</p>\n<p>We may have to know another 2 words prior to understand ‘intersubjective’, they are ‘objective’ and ‘subjective’. These 3 words mostly use for categorize data that we received.</p>\n<p>If the data is objective, it means that it is fact and not involve any bias from speaker for example, “headphone is on the desk” or “current temperature is 25 degree” but if we said that “25 degree is hot” this is subjective because other people in the room may not feel the same as you.</p>\n<p>If the data is subjective, it means that it based on opinion of the speaker for example when someone told you that chicken rice from a shop is very good but when you tried it not good because taste is subjective. Even the same person eat the same menu on difference time the taste can be difference. How fun is the movie or how good is the song are also subjective.</p>\n<p>Intersubjective means the subjective data that there are more than one people agree with. Basic example is the chicken rice shop above if someone agree with you that it is delicious or someone agree with you that 25 degree is hot, both are intersubjective. Religion is also intersubjective, very big one.</p>\n<p>Awareness of which data is which can improve our decision making or better processing of incoming information.</p>\n<hr>\n<p>ยาวไปไม่อ่าน - Objective คือ ข้อเท็จจริง Subjective คือ ความคิดเห็น และ Intersubjective คือ ความคิดเห็นที่มีคนเห็นด้วยร่วมกัน</p>\n<p>ระหว่างที่ฟัง <a href=\"https://www.audible.com/pd/Sapiens-Audiobook/B0741G911Q\">Sapiens : a brief history of humankind</a> บท There is no justice in history ก็ได้ยินศัพท์ Intersubjective ซึ่งถือว่าเป็นคำใหม่สำหรับผม ค้นคว้าเพิ่มเติม แล้วจึงมาจดบันทึกไว้หน่อย</p>\n<p>จะเข้าใจคำว่า Intersubjective อาจจะต้องเข้าใจอีก ๒ คำ ที่เกี่ยวข้องกันก่อน คือ Objective และ Subjective ทั้ง ๓ คำ ส่วนใหญ่จะใช้เพื่อจำแนกประเภทของข้อมูลที่เราได้รับกันทุกวัน</p>\n<p>ข้อมูลที่เป็น Objective นั้นหมายถึง ข้อมูลนั้น ตั้งอยู่บนข้อเท็จจริง และไม่มีความรู้สึกของผู้พูดเข้ามาเกี่ยวข้อง เช่น หูฟังนั้นตั้งอยู่บนโต๊ะ ตอนนี้อุณหภูมิ 25 องศา แต่ถ้าเราบอกว่าตอนนี้ร้อน ถือเป็น Subjective เพราะบางคนถือว่ากำลังเย็นสบาย</p>\n<p>ข้อมูลที่เป็น Subjective นั้นหมายถึง ข้อมูลนั้นเป็นสิ่งที่ตั้งอยู่บนความคิดเห็นของผู้พูดเท่านั้น เช่น มีเพื่อนบอกว่าข้าวมันไก่ร้านนี้อร่อยมาก แต่พอเราไปกินกลับรู้สึกว่ามันไม่ได้อร่อยขนาดนั้น เพราะความอร่อยนั้นเป็น Subjective แม้แต่คนเดียวกัน มากินต่างเวลากัน หรือต่างอารมณ์ความรู้สึกกัน ก็สามารถจะรับรู้รสต่างกันได้ อาหารอร่อย หนังสนุก เพลงเพราะ นั้นล้วนเป็น Subjective</p>\n<p>มาถึงคำว่า Intersubjective คิดง่ายๆคือข้อมูล Subjective ที่มีคนเห็นด้วยร่วมกันมากกว่า ๑ คน ยกตัวอย่างง่ายๆ คือ ผมบอกว่าก๋วยเตี๋ยวเจ้าหนึ่งแถวบ้านอร่อยมาก พี่ชายผมก็เห็นเช่นนั้น แบบนี้เรียกว่า Intersubjective หรือ ให้สเกลใหญ่ขึ้นไปกว่านั้นสักหน่อยก็ คนกลุ่มหนึ่งเลือกนักการเมืองเข้าไป เพราะคิดว่าเค้าเป็นคนดีที่สุดที่จะเข้ามาบริหารบ้านเมือง ถือเป็นความเชื่อร่วมกันของคนกลุ่มหนึ่ง ใหญ่กว่านั้นอีกก็ ศาสนา ที่เป็น Intersubjective topic ที่ใหญ่มากๆ</p>\n<p>การที่สามารถตระหนัก และรู้ว่า สิ่งที่เราได้ยิน, อ่าน หรือดู นั้นเป็นข้อมูลประเภทไหน จะช่วยให้เราตัดสินใจ หรือเชื่ออะไร ได้ดีขึ้น</p>\n<hr>\n<p>references:</p>\n<ul>\n<li><a href=\"https://www.quora.com/What-is-the-difference-between-objectivity-and-intersubjectivity\">What is the difference between objectivity and intersubjectivity?</a></li>\n<li><a href=\"https://www.quora.com/What-is-the-difference-between-objective-and-subjective\">What is the difference between objective and subjective?</a></li>\n</ul>","frontmatter":{"title":"Objective, Subjective and Intersubjective","date":"December 25, 2018"}}},"pageContext":{"slug":"/objective-subjective-intersubjective/","previous":{"fields":{"slug":"/positive-constructive-feedback/"},"frontmatter":{"title":"Positive Constructive Feedback"}},"next":{"fields":{"slug":"/mistakes-2019/"},"frontmatter":{"title":"Mistakes in 2019"}}}}