{"data":{"site":{"siteMetadata":{"title":"warizz.io","author":"Warizz Yutanan"}},"markdownRemark":{"id":"4380f575-2cfe-578d-953b-4bdd229481f7","excerpt":"Khao San Nok Wua (or cow-hump mountain in English, from now on I will refer to it as KSNW) hiking is a short trip. Walking up to its base camp could take 3-…","html":"<p>Khao San Nok Wua (or cow-hump mountain in English, from now on I will refer to it as KSNW) hiking is a short trip. Walking up to its base camp could take 3-5 hours for 9 kms with some steep elevation around last 2 kms. Around the camp</p>\n<p>การเดินขึ้นสันหนอกวัว จะต้องมีการจองกับทางเจ้าหน้าที่่ก่อน เป็นทริปที่ค่อนข้างสั้น เพราะขึ้นไปนอนเพียงแค่คืนเดียว ก็เพียงพอ และเดินไม่ยากมาก มีช่วงชันแบบเหนื่อยสุดๆ ประมาณเกือบถึงจุดตั้งแคมป์สัก ๒ กิโลฯ เดินขึ้นใช้เวลาประมาณ ๓ ถึง ๕ ชั่วโมง และเดินขึ้นยอด ๒ ยอดเพื่อชมพระอาทิตย์ขึ้นและตก อีกไม่เกินครึ่งชั่วโมง บริเวณจุดตั้งแคมป์เป็นที่ราบริมผา มีต้นไม้ประปราย สามารถมองเป็นมุมกว้างเห็นผืนป่าด้านล่างออกไปได้ไกลสุดสายตา และยังสามารถเห็นไปถึงเขื่อนที่อยู่ใกล้ๆได้เลย</p>\n<p>การจองนั้นไม่ยาก แต่มีรายละเอียดปลีกย่อยนิดหน่อย สามารถหาอ่านได้เต็มๆ ได้ที่ลิงก์นี้ แต่ถ้าคุณเป็นคนต่างชาติ อาจจะมีความลำบากนิดนึง ตอนที่ผมไปนั้น ค่ามัดจำ คนละ ๑๐๐ บาท และค่าลูกหาบที่แบกได้ ๓๐ กิโล คนละ ๑๔๐๐ บาท น้ำหนักเกินกว่านั้นคิดกิโล ๔๙ บาท</p>\n<p>วันเดินทาง อุทยานจะเปิดให้ลงทะเบียนได้ตั้งแต่ ๘ โมง ถึง ๑๐ โมง ลงชื่อเสร็จก็ชั่งน้ำหนักสัมภาระ และให้ลูกหาบเอาไปเตรียมแบก เมื่อทุกอย่างพร้อม เจ้าหน้าที่จะพาขับรถกระบะพาเราไปจุดเริ่มเดิน ใช้เวลาประมาณ ๑๕ นาที ก็ถึง</p>\n<p>การเดินขึ้นสักหนอกวัวจะแบ่งออกเป็น ๗ จุด จุดแรกคือจุดเริ่มต้น (จะเรียกว่าเป็นจุดที่ ๐ ก็แล้วกัน) ที่เจ้าหน้าที่ขับรถพาเรามาส่ง จากนั้นจะแบ่งเป็น ๕ จุดพัก และจุดสุดท้ายคือจุดตั้งแคมป์ จาก ๐ ไป ๑ ไป ๒ ไป ๓ และไป ๔ นั้นเดินไม่ยากมาก ระดับความชันจะไม่เยอะ แต่จาก ๔ ถึง จุดค้างแรมนั้น โหดพอสมควร มีบางจุดที่เจ้าหน้าที่ต้องผูกเชือกไว้ให้นักท่องเที่ยวช่วยพยุงเพราะทางชันและลื่น</p>\n<p>ถึงแคมป์ ลูกหาบจะจัดแจงกางเตนท์ หาฟืนจุดไฟ และไปแบกน้ำใส่แกลลอนมาให้ มาถึงเร็วก็มีเวลาพักผ่อนเยอะ ก่อนที่จะถึง ๕ โมงเย็น เพื่อจะเดินไปชมพระอาทิตย์ตกที่หนอกเล็กและใหญ่</p>\n<p>การเดินขึ้นหนอกเล็ก หรือหนอกใหญ่นั้นค่อนข้างง่าย มีความชันแต่ระยะสั้น ขึ้นถึงยอดใช้เวลาไม่น่าเกินหนอกละ ๑๕ ถึง ๒๐ นาที แต่โชคร้าย วันที่ไปเมฆเยอะ ทั้งเย็นและรุ่งเช้าทำไห้ไม่ได้เห็นพระอาทิตย์ขึ้นและตกเลย แต่ยังดีที่ช่วงเย็นมีฟ้าระเบิดสวยงามทีเดียว</p>\n<p>ที่แย่สุดคือตอนกลางคืน เพราะลมแรงมาก แล้วด้วยที่ตัวเตนท์ที่เอาไป ก็ชำรุดอยู่ก่อนแล้ว เจอแรงลมขนาดนี้ก็เลยพัง หมุดหลุด เสาหลุด เจ้าหน้าที่ต้องเข้ามาช่วยซ่อมเตนท์ให้ (แต่สุดท้ายก็พังอยู่ดี) ถามเจ้าหน้าที่เช้าวันรุ่งขึ้นได้ความว่า ลมวันนี้แรงที่สุดเทียบกับวันก่อนๆหน้า หลังจากที่ซ่อมเตนท์นี้ ไปต้องไปซ่อมให้นักเดินทางคนอื่นๆด้วยยาวจนถึงตี ๒ ถ้าฝนตกลงมาด้วย ทุกอย่างคงเละเทะไปหมด</p>","frontmatter":{"title":"Trip 2019 No.1: hiking at Khao San Nok Wua, Kanjanaburi","date":null}}},"pageContext":{"slug":"/trip-2019-01/","previous":{"fields":{"slug":"/reading-other-people-code-ep-1/"},"frontmatter":{"title":"Reading other people's code episode 1: _.get"}},"next":null}}