{"data":{"site":{"siteMetadata":{"title":"warizz.io","author":"Warizz Yutanan"}},"markdownRemark":{"id":"7919782e-11f4-5263-9c52-78f1727c47e8","excerpt":"I have always wanted to write a diary for a very long time. I have tried so many times for my entire life but I have never done it longer than a month. I don’t…","fields":{"slug":"/the-bullet-journal-method/"},"html":"<p>I have always wanted to write a diary for a very long time. I have tried so many times for my entire life but I have never done it longer than a month. I don’t know why I can’t keep the routine but a feeling I remembered was it is too much for a day, I don’t know where to start and what to write. I have tried apps and it never works for reasons. One day, I found this, “The Bullet Journal Method” book from a Facebook page, <a href=\"https://www.facebook.com/thecuratorclub.co\">The Curator</a>, I didn’t buy it at first, I googled about it and found out that it is interesting. I learned from the official BuJo web and BuJo veteran videos. I tried for a few weeks then bought this book to learn the principles and fundamentals of it.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/7cd889a8b3dfaaec4acc033fd2d00d25/c2136/bj-2.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 69.49152542372882%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAOABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAAECBf/EABUBAQEAAAAAAAAAAAAAAAAAAAAB/9oADAMBAAIQAxAAAAHvyyNCv//EABcQAAMBAAAAAAAAAAAAAAAAAAABEBH/2gAIAQEAAQUCFcn/xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAEDAQE/AT//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAECAQE/AT//xAAUEAEAAAAAAAAAAAAAAAAAAAAg/9oACAEBAAY/Al//xAAYEAEBAAMAAAAAAAAAAAAAAAABEAARIf/aAAgBAQABPyF5i3QE/9oADAMBAAIAAwAAABC8D//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8QP//EABURAQEAAAAAAAAAAAAAAAAAABAh/9oACAECAQE/EKf/xAAbEAEAAgIDAAAAAAAAAAAAAAABABEQITFBUf/aAAgBAQABPxBUV6itsrzCCU8TYBvH/9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"mindfulness writing 1\"\n        title=\"\"\n        src=\"/static/7cd889a8b3dfaaec4acc033fd2d00d25/f8fb9/bj-2.jpg\"\n        srcset=\"/static/7cd889a8b3dfaaec4acc033fd2d00d25/e8976/bj-2.jpg 148w,\n/static/7cd889a8b3dfaaec4acc033fd2d00d25/63df2/bj-2.jpg 295w,\n/static/7cd889a8b3dfaaec4acc033fd2d00d25/f8fb9/bj-2.jpg 590w,\n/static/7cd889a8b3dfaaec4acc033fd2d00d25/85e3d/bj-2.jpg 885w,\n/static/7cd889a8b3dfaaec4acc033fd2d00d25/d1924/bj-2.jpg 1180w,\n/static/7cd889a8b3dfaaec4acc033fd2d00d25/9452e/bj-2.jpg 1770w,\n/static/7cd889a8b3dfaaec4acc033fd2d00d25/c2136/bj-2.jpg 2360w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>My Bujo is so simple, I have future logs, monthly logs, weekly logs, and daily logs moreover I try not to have any stylish decorations at all. I wrote a key reason for doing it that is I want a tool or a framework for life journal not for productivity. I do BuJo every morning when I arrived at my office desk, I will usually be there at 8am so the office still very quiet I can concentrate more on taking everything out of the brain. After putting down my belongings, make a coffee, get the favorite pen, take out THE notebook, and then the ritual begins. I will try to write everything notable down, roughly as a bullet per event or idea if any point has more reflection I will make a mark (+) so I can come back and think more about it later. I have one habit tracking for drawing 3 times a week, gratitude logs every day for more positive thought (should begin with “I’m grateful for…”), if I have done something that I feel bad about it, I will write it down as “I’m sorry for…” so I can learn something about the mistake. Blog draft or any idea I write it separately as a collection.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/11fa1c3df1ea180776fb50ba2b48e063/c2136/bj-1.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 69.49152542372882%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAOABQDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAEF/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAH/2gAMAwEAAhADEAAAAd5UBX//xAAUEAEAAAAAAAAAAAAAAAAAAAAg/9oACAEBAAEFAl//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAEDAQE/AT//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAECAQE/AT//xAAUEAEAAAAAAAAAAAAAAAAAAAAg/9oACAEBAAY/Al//xAAYEAADAQEAAAAAAAAAAAAAAAABEBEAIf/aAAgBAQABPyEmOd0X/9oADAMBAAIAAwAAABBLz//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8QP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8QP//EABoQAQACAwEAAAAAAAAAAAAAAAEAERBRYXH/2gAIAQEAAT8Q7K5LQMNhonrH/9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"mindfulness writing 2\"\n        title=\"\"\n        src=\"/static/11fa1c3df1ea180776fb50ba2b48e063/f8fb9/bj-1.jpg\"\n        srcset=\"/static/11fa1c3df1ea180776fb50ba2b48e063/e8976/bj-1.jpg 148w,\n/static/11fa1c3df1ea180776fb50ba2b48e063/63df2/bj-1.jpg 295w,\n/static/11fa1c3df1ea180776fb50ba2b48e063/f8fb9/bj-1.jpg 590w,\n/static/11fa1c3df1ea180776fb50ba2b48e063/85e3d/bj-1.jpg 885w,\n/static/11fa1c3df1ea180776fb50ba2b48e063/d1924/bj-1.jpg 1180w,\n/static/11fa1c3df1ea180776fb50ba2b48e063/9452e/bj-1.jpg 1770w,\n/static/11fa1c3df1ea180776fb50ba2b48e063/c2136/bj-1.jpg 2360w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>I have been doing BuJo for 3 months now and the main priority still is making it a practical life journal, it feels good to look back to the life a week or a month ago. Having reflection also make you think about life and everything around more elaborately, have more idea to do or wait to be implemented Everytime I write, have better small plans throughout a month, it spark more and more joy and does not feel like a burden to do it. I wish I can keep this feeling and do it for entire year, let’s see what it is going next after that.</p>\n<hr>\n<h2>My highlights from reading the book</h2>\n<h3>I: The Preparation</h3>\n<h4>Introduction</h4>\n<p>Over the coming weeks, Sandy’s habit of sitting down with her Bullet Journal became as effortless as brushing her teeth. Silly as it seemed, crossing off little boxes kept her motivated by reminding her that there was a finite number of tasks to do every day.</p>\n<p>Another surprising thing was that the layout of the Bullet Journal reminded her that mundane tasks were part of the bigger picture. The Monthly Goals and Yearly Goals pages showed her every day that she had a long game, and that she was on her way. Her trick was to add a tiny passion project — say, 15 minutes of lettering by hand — to every Daily Log ,</p>\n<p>Whether you’re an experienced Bullet Journalist or a newcomer, The Bullet Journal Method is for anyone struggling to find their place in the digital age. It will help you get organized by providing simple tools and techniques that can inject clarity, direction, and focus into your days. As great as getting organized feels, however, it’s just the surface of something significantly deeper and more valuable.</p>\n<p>He tried a few apps to keep himself organized, but none were as flexible as he needed. He took to keeping notebooks of to-do lists, but they were a mess. Clients would call him without warning, and he’d rifle through six different notebooks trying to find the notes he needed. He knew he’d written this down… somewhere.</p>\n<p>He became a lot more introspective. He realized that he loved making to-do lists, and he loved knocking out tasks even more. Best of all, self-confidence had room to take root in the clean, clear space of his notebook: Having things written down gave him the guts he needed when on the phone with a client. Being prepared, and knowing his material, made him feel less like a salesman and more like a craftsman.</p>\n<p>The Bullet Journal method consists of two parts: the system and the practice. First we’ll learn about the system, to teach you how to transform your notebook into a powerful organizational tool. Then we’ll examine the practice. It’s a fusion of philosophies from a variety of traditions that define how to live an intentional life — a life both productive and purposeful.</p>\n<h4>The Promise</h4>\n<p>The Bullet Journal method’s mission is to help us become mindful about how we spend our two most valuable resources in life: our time and our energy.</p>\n<p>The Bullet Journal method will help you accomplish more by working on less. It helps you identify and focus on what is meaningful by stripping away what is meaningless.</p>\n<p>One possible explanation for our productivity slowdown is that we’re paralyzed by information overload. As Daniel Levitin writes in The Organized Mind, information overload is worse for our focus than exhaustion or smoking marijuana.</p>\n<p>It stands to reason, then, that to be more productive we need a way to stem the tide of digital distractions. Enter the Bullet Journal, an analog solution that provides the offline space needed to process, to think, and to focus. When you open your notebook, you automatically unplug.</p>\n<p>The Bullet Journal will help you declutter your packed mind so you can finally examine your thoughts from an objective distance.</p>\n<p>We often cobble together ways to organize ourselves on the fly. A little of this app; a little of that calendar. Over time, this results in an unwieldy productivity Frankenstein of Post-its, various apps, and email.</p>\n<p>The Bullet Journal is designed to be your “source of truth.” No, this is not some dubious invitation to worship this methodology. It means that you no longer have to wonder where your thoughts live.</p>\n<p>Rather than being proactive about setting priorities, a lot of us simply let the flood of external demands set them for us.</p>\n<p>BuJo puts you at the helm. You’ll learn how to stop reacting and start responding.</p>\n<p>When we talk about mindfulness, we’re typically talking about a heightened awareness of the present. Productivity is all fine and good, but BuJo isn’t designed to help you spin faster on the hamster wheel.</p>\n<p>If the journey is the destination, then we must learn how to become better travelers. To become better travelers, we must first learn to orient ourselves. Where are you now? Do you want to be here? If not, why do you want to move on?</p>\n<p>Knowing where you are begins with knowing who you are.</p>\n<p>Mindfulness is the process of waking up to see what’s right in front of us. It helps you become more aware of where you are, who you are, and what you want. This is where BuJo comes into play. The act of writing by hand draws our mind into the present moment on a neurological level unlike any other capturing mechanism.</p>\n<p>In other words, the Bullet Journal method keeps us mindful of why we’re doing what we’re doing.</p>\n<p>The rush of our busy lives can quietly carve out a gulf separating our actions from our beliefs. We tend to follow the path of least resistance, even when it leads away from the things we care about. It can require a lot of ongoing effort to effect the change we seek. As any athlete will tell you, you need to tear muscle to build it, over and over again. Like building muscle, we need to train our intentions to make them resilient and strong.</p>\n<p>To successfully introduce a new sustainable routine, it needs to fit into your packed schedule.</p>\n<p>Through Bullet Journaling, you’ll automatically form a regular habit of introspection where you’ll begin to define what’s important, why it’s important, and then figure out how to best pursue those things. You’re gently reminded of these insights every day, which makes it easier to put them into action wherever you happen to be, be it a boardroom, classroom, or even an emergency room.</p>\n<h4>The Why</h4>\n<p>Bronnie Ware, an Australian nurse and author who spent several years working in palliative care with patients in the last weeks of their lives, recorded her patients ’ top five regrets. The number one regret was that people wished they had stayed true to themselves.</p>\n<p>Intentionality is the power of the mind to direct itself toward that which it finds meaningful and take action toward that end. If intentionality means acting according to your beliefs, then the opposite would be operating on autopilot. In other words, do you know why you’re doing what you’re doing?</p>\n<p>Both of us loving what we did meant we were used to giving our jobs a huge chunk of our attention, and that was important to us. We had to learn how to prioritize our marriage instead of just our work. We could have used digital calendars to sync up, but the discipline of analog and the experience of sitting down with our Bullet Journals to physically mark in events helped us have the conversations we needed to have and to look further ahead so we weren’t always blindsided by the next thing. It also helped us express concerns if we were starting to schedule too many things outside the home. It made us feel like a unit, planning our life together, instead of trying to slam two busy calendars together.</p>\n<p>Leading an intentional life is about keeping your actions aligned with your beliefs.</p>\n<h4>Decluttering Your Mind</h4>\n<p>“No. You’ve got it wrong, Mike. Everything you didn’t circle just became your Avoid-At-All-Cost list. No matter what, these things get no attention from you until you’ve succeeded with your top five.”</p>\n<p>In an interview published in Vanity Fair, President Barack Obama said, “You’ll see I wear only gray or blue suits. I’m trying to pare down decisions. I don’t want to make decisions about what I’m eating or wearing. Because I have too many other decisions to make.”</p>\n<p>As psychologist Roy F. Baumeister wrote in his book Willpower: “No matter how rational and high-minded you try to be, you can’t make decision after decision without paying a biological price. It’s different from ordinary physical fatigue — you’re not consciously aware of being tired — but you’re low on mental energy.” 11 This state is known as decision fatigue. In other words, the more decisions you have to make, the harder it becomes to make them well. This is why you’re more likely to eat an unhealthy dinner at the end of the day than an unhealthy breakfast at the beginning of the day, when you have a full tank of willpower.</p>\n<p>Holding on to thoughts is like trying to catch fish with your bare hands: They easily slip from your grasp and disappear back into the muddy depths of your mind. Writing things down allows us to capture our thoughts and examine them in the light of day.</p>\n<p>ask yourself what would happen if said item just didn’t get done. Ever. Would there be any real repercussions?</p>\n<p>More accurately, each item needs to fight for the opportunity to become part of your life.</p>\n<p>When you’re done, you’ll probably be left with two types of tasks: things you need to do ( your responsibilities ) and things you want to do ( that is, your goals ).</p>\n<h4>Notebooks</h4>\n<p>We’re steadily decreasing the amount of time we have to stop and think. Sitting down with your notebook grants you that precious luxury. It provides a personal space, free from distraction, where you can get to know yourself better. This is one of the main reasons we use a notebook to Bullet Journal: It forces us to go offline.</p>\n<p>Our notebook serves as a mental sanctuary where we are free to think, reflect, process, and focus.</p>\n<p>The blank pages of your notebook offer a safe playground for your mind, where you’re completely free to express yourself without judgment or expectation.</p>\n<h4>Handwriting</h4>\n<p>The complex tactile movement of writing by hand stimulates our mind more effectively than typing. It activates multiple regions of the brain simultaneously, thereby imprinting what we learn on a deeper level. As a result, we retain information longer than we would by tapping it into an app.</p>\n<p>Why is it so important to craft notes in your own words? The science suggests that writing by hand enhances the way we engage with information, strengthening our associative thinking. It allows us to form new connections that can yield unconventional solutions and insights. We’re simultaneously expanding our awareness and deepening our understanding.</p>\n<p>“The long way is the short way.” In a cut-and-paste world that celebrates speed, we often mistake convenience for efficiency. When we take shortcuts, we forfeit opportunities to slow down and think.</p>\n<p>True efficiency is not about speed; it’s about spending more time with what truly matters. In the end, that’s what the Bullet Journal method is all about.\nII: The System</p>\n<h4>Rapid Logging</h4>\n<p>Our experiences — both sweet and sour — are lessons. We honor these lessons by writing them down so we can study them and see what they have to teach us. This is how we learn, this is how we grow. If we forfeit the opportunity to learn from our experiences, as the saying ( sort of ) goes, we condemn ourselves to repeat our mistakes.</p>\n<h4>Topics and Pagination</h4>\n<p>Pausing to define the agenda before you start allows you to focus, prioritize, and use your time far more effectively. Giving your page its Topic provides that opportunity to pause. What will you capture in this space? What’s its purpose? What value will it add to your life?</p>\n<h4>Bullets</h4>\n<p>Rapid Logging solves this issue in a few ways, first by categorizing entries into: Things that you need to do ( Tasks ) Your experiences ( Events ) Information you don’t want to forget ( Notes )</p>\n<h4>Events</h4>\n<p>Event bullets allow you to put a pin in an experience, to temporarily offload it from your mind, so you can refocus on other priorities.</p>\n<p>Our memories are unreliable. We often trick ourselves into believing things about our experiences that are biased and inaccurate. Studies suggest that our recollection of how we felt can greatly differ from the way an experience actually made us feel. We can remember wonderful events in a negative way, and negative events in a positive way. Harvard psychologist Dan Gilbert likens our memories to painted portraits instead of photographs, where our mind artistically interprets memory. 20 It’s important to keep an accurate record of how things actually happened, because we often make decisions based on our past experiences. If we operate entirely on memory, we’re apt to repeat our mistakes by fooling ourselves into believing that something had an effect it actually did not.</p>\n<h4>Notes</h4>\n<p>Once the event is over, take a few moments and use the time to your advantage. Sit for a while and give yourself a moment to process what you heard.</p>\n<p>One simple way to summarize all these tips is this: Keep your future self in mind. Your Notes will be useless if they can’t be deciphered in a week, month, or year from now.</p>\n<h4>Signifiers and Custom Bullets</h4>\n<p>TIP: Keep Custom Bullets and Signifiers to an absolute minimum. Rapid Logging tries to remove as much friction as possible from capturing information. The more you invent, the more complex it is, and the slower you will become.</p>\n<h4>The Index</h4>\n<p>Over time your Index will double as a “table of context.” It provides you with a bird’s-eye view of how you’re investing your time and energy. It’s a map of all the things you’re saying yes to. Remember, for everything you say yes to, you’re also saying no to something else.</p>\n<h4>Migration</h4>\n<p>Big or small, migrate only the content and techniques that have proven themselves to be valuable, nothing else. A new notebook is not about starting over — it’s about leveling up.</p>\n<h3>III: The Practice</h3>\n<h4>The Practice</h4>\n<p>Happiness is the by-product of meaning. In order to be happy, you have to figure out what is meaningful. You figure out what is meaningful by putting in the time to.</p>\n<p>Small questions and small solutions lead to big change over time. Productivity is about sustainable improvement. In order to achieve that you have to.</p>\n<p>The only thing you can control is the way you respond. Focusing on things you can’t control allows them to control you. Focus on what you can control.</p>\n<h4>Reflection</h4>\n<p>The less time you spend examining things, the less you know about them. When it comes to understanding how you spend your life, it’s important to slow down and take the time.</p>\n<p>For everything we say yes to, we’re saying no to something else. Migration gives you an opportunity to recommit to what matters and let go of what does not. As Bruce Lee once said, “It is not daily increase but daily decrease; hack away the unessential.”</p>\n<h4>Meaning</h4>\n<p>So are all our goals, all our striving, ultimately pointless? Not in the least. It means that happiness itself can’t be the goal. Clearly happiness is important, so the question becomes: How do we lure it into our lives?</p>\n<p>When asked what their secret to happiness was, a common answer was ikigai. “Your ikigai is at the intersection of what you are good at and what you love doing,”</p>\n<h4>Goals</h4>\n<p>We can do no great things; only small things with great love. — MOTHER TERESA</p>\n<p>Your goals need real substance in order to be sustainable. You need to understand exactly why you need a million dollars.</p>\n<p>Give your goals the opportunity they deserve to reveal their lessons by focusing on the process. It’s arguably the process, rather than the goals themselves, that will prove to be most valuable. The process accounts for the majority of the experience and therefore provides the bulk of the information that will help you grow.</p>\n<p>I learned a lot working on that project, but most importantly I learned that pursuing this career would leave me one fry short of a Happy Meal. Sure, the realization was a bit heartbreaking, but it was also a relief. It freed me to explore other things. Now I never look back and wonder what might have been.</p>\n<h4>Small Steps</h4>\n<p>By bringing our attention to the little things, we can effect change while we avoid overwhelm. All we need to do is solve one small problem at a time. Each solution builds on those that came before it, and therefore these small steps add up quickly, effecting massive change over time.</p>\n<p>Whatever obstacles or challenges you may encounter along the way, meet them with curiosity. Embrace them and examine them by asking small questions.</p>\n<h4>Time</h4>\n<p>The hard truth is that we can’t “make time,” we can only “take time.” Though we can’t make more, we can increase the quality of the time we take.</p>\n<h4>Gratitude</h4>\n<p>A common misconception about meditation is that it’s about getting rid of thoughts. Rather, mindfulness helps distance yourself from them. A helpful metaphor shared by one of my teachers was that if thoughts were cars, meditation helps us stand on the side of the road rather than getting stuck in traffic.</p>\n<p>The next time you cross off a Task in your BuJo, slow down. Take a moment to pause and reflect on the impact of your accomplishment. What do you feel? If by chance you feel nothing — or maybe nothing but relief — then chances are the thing you’re working so diligently toward isn’t adding much value to your life.</p>\n<p>A simple yet meaningful way to begin appreciating your achievements is to write them down. Committing them to paper makes you pause and honor a good moment with your attention. In the Bullet Journal, you can do this by logging Events that you’re grateful for in your Daily Log, in your Monthly Calendar, or in a Gratitude Log.</p>\n<p>As you actively examine your experience to find the good, you become better at locating it and appreciating it. You learn that — to paraphrase the Benedictine monk David Steindl-Rast — you can’t be grateful for everything, but you can be grateful in every moment</p>\n<h4>Control</h4>\n<p>Let the heat of the moment pass. During your Daily Reflection, you can start to examine the experience from a better place. Why did he say or do what he did? Why would he volunteer this questionable opinion? Why did it upset you exactly? What are your options here?</p>\n<p>Worry baits us with the promise of a solution but usually offers none. As the Dalai Lama once said: “If a problem can be solved, there is no use worrying about it. If it can’t be solved, worrying will do no good.”</p>\n<h4>Radiance</h4>\n<p>Like a pebble dropped into a lake, our actions ripple out into the world around us. Each ripple influences what it encounters, which in turn ripples out even farther. When you hold the door open for someone, for example, it may inspire a willingness for them to do so for the next person or to extend a different kindness that would not have existed without your influence. Similarly, when you snap at someone, chances are their spouse, friend, or child will be subject to the ripple effects of your action. I like to refer to this ability of ours to influence the world around us as our radiance — literally, what we radiate.</p>\n<p>As Joshua Fields Millburn of the Minimalists once quipped, “You can’t change the people around you, but you can change the people around you.” 53 You get to choose who you spend your precious time with. Surround yourself with people who want the best for you.</p>\n<p>Whether it’s reading, classes, conversations with trusted friends and mentors, or enriching experiences, make it part of your plans. Use your Bullet Journal to identify the things that inspire further inquiry. Once you know what grabs your interest, set your goals</p>\n<h4>Endurance</h4>\n<p>This task began to matter to me, and I tried harder. One day she walked by while I was cleaning up after the best meal I’ve ever enjoyed, and she kissed me on the cheek and said, “Thank you. I know it was a lot tonight and that you hate doing this, but it really helps me. It makes me feel loved.”</p>\n<p>Sam Cawthorn, founder of Speakers Tribe, once said, “The happiest people don’t necessarily have the best of everything, but they make the most of everything.” 54 A powerful way to begin this process is to reframe the mundane in our mind.</p>\n<h4>Deconstruction</h4>\n<p>We have a tendency to blow our problems way out of proportion. No matter how bad a problem really is, chances are we’re making it much worse in our minds.</p>\n<h4>Inertia</h4>\n<p>We’re apt to lose our objectivity when we’re spinning our wheels. By explaining a problem in detail to someone ( or something ) else, we’re forced to change our perspective, viewing it from above, so to speak, and not from the depths of whatever mental hole we’ve dug ourselves into.</p>\n<h4>Imperfection</h4>\n<p>In Japan, there is the term wabi-sabi. Wabi-sabi posits that the beauty of an object is found in its imperfection. In direct contrast to the Western perspective, which tends to conflate perfection with beauty, wabi-sabi celebrates transience, individuality, and the flawed nature of a thing. These are the qualities that make it unique, genuine, and beautiful.</p>\n<p>Embracing our imperfection puts the emphasis back where it should be: continual improvement. This mind-set turns mistakes from land mines into street signs, pointing us toward where we need to go.</p>\n<p>Do you abandon notebooks when you make a mistake or get a false start? If so, try creating an “Imperfection Collection” Somewhere in your notebook, dedicate space where you just. let. go. Maybe start by writing your name with your nondominant hand. Scribble, doodle, whatever you like. Do what you fear would make your notebook feel flawed.</p>\n<h3>IV: The Art</h3>\n<h4>Custom Collections</h4>\n<p>If there’s nothing to be learned from the information in a Collection, it provides little value, and chances are you’ll lack the incentive needed to maintain it. Don’t waste your time tending Collections that won’t add value to your life.</p>\n<p>understanding why you feel compelled to do something will help you better define how to do something.</p>\n<h4>Design</h4>\n<p>By keeping your templates lean, it becomes easier to identify opportunities for functional improvement. Keep it simple. Keep it focused. Keep it relevant.</p>\n<p>Legibility is not just about what we put on the page, it’s also about what we leave off. Claude Debussy once said that music is the space between notes.</p>\n<p>A key part of Bullet Journaling is learning what you’re curious about and what you naturally gravitate toward. Evaluating your Collections during Migration quickly reveals what kinds of things actually hold your attention and what you struggle with.</p>\n<h4>Planning</h4>\n<p>Professional cooks have all their ingredients prepped and laid out well before they start to assemble their plates. The vegetables are chopped, garnishes minced, the surfaces are cleaned. This is known as the mise en place, or mise ( rhymes with “cheese” ), which is French for “putting in place.” This practice allows the cook to focus on what’s important: assembling the meal. In your Bullet Journal, you’re the chef.</p>\n<h4>Trackers</h4>\n<p>Though making progress is clearly desirable, it shouldn’t be your sole focus. Only focusing on the outcome will often blind you to valuable information that surfaces during the process itself. I would argue that the point of tracking is just as much about cultivating self-awareness as it is about making progress.</p>\n<h3>V: The End</h3>\n<h4>The Correct Way to Bullet Journal</h4>\n<p>Though I strongly advise starting out simple, if spending the time to embellish your Bullet Journal motivates you, makes you more productive, and brings you joy, then you’re doing it right. If you look forward to coming back to your journal and feel that it’s your ally, then you’re doing it right.</p>\n<h4>Frequently Asked Questions</h4>\n<p>Q: What notebook should I use? A: A high-quality notebook that will last. The two main things to keep in mind are size and quality. If it’s too big, you’ll never take it with you. If it’s too small, it will be impractical. Be sure to get something that’s rugged enough to keep up with you, and that can stand the test of time.</p>\n<p>I highly recommend adding a very visible note in the front of the book for people to contact you should you lose it. Leaving your first name and your phone number only should do the trick.</p>","frontmatter":{"title":"The Bullet Journal Method","date":"March 16, 2021","lang":null,"langs":null}}},"pageContext":{"slug":"/the-bullet-journal-method/","previous":{"fields":{"slug":"/assassins-creed-origin/"},"frontmatter":{"title":"Assassin's Creed: Origin","lang":null}},"next":{"fields":{"slug":"/comic/snail/"},"frontmatter":{"title":"The snail","lang":null}}}}